In [1]:
import gzip
import json
import ast
import numpy as np
import pandas as pd
#df = getDF('reviews_Amazon_Instant_Video.json.gz')[['reviewerID','asin']]
#df  is the whole table of data, we need to act on this
# very imp code : https://stackoverflow.com/questions/49405101/grouping-all-rows-of-a-pandas-dataframewith-many-columns-with-the-same-value-i
#df = df[['reviewerID','asin']]
#df1 = df.astype(str).groupby('asin').agg(','.join).reset_index()
#df1

In [21]:
alpha_network_data = pd.read_csv("alpha_network.csv")
alpha_network_data.columns=["src", "Dest", "Rating", "Timestamp"]
alpha_network_data = alpha_network_data[["src", "Dest"]]
alpha_network_data1 = alpha_network_data.astype(str).groupby("Dest").agg(','.join).reset_index()
alpha_network_data1

      Dest                                                src
0        1  430,3134,3026,3010,804,160,95,377,888,89,1901,...
1       10  1,2,3,4,8,37,177,623,130,334,62,161,11,67,42,5...
2      100  3,5,6,7,11,12,14,16,21,26,44,50,52,66,90,827,1...
3     1000                                            509,772
4     1001                         39,132,340,368,403,573,580
...    ...                                                ...
3749   995                                        166,504,608
3750   996                                       168,353,1615
3751   997                                            129,848
3752   998                                        129,473,775
3753   999                                    109,181,447,473

[3754 rows x 2 columns]

In [10]:
alpha_gt_data = pd.read_csv("alpha_gt.csv")
alpha_gt_data.columns = ["ID","Label"]
alpha_gt_data

       ID  Label
0     335      1
1      28      1
2     336      1
3     333      1
4     765      1
..    ...    ...
234  7503     -1
235  7540     -1
236  7542     -1
237  7543     -1
238  7544     -1

[239 rows x 2 columns]

In [23]:
amazon_network_data = pd.read_csv("amazon_network.csv")
amazon_network_data.columns=["src", "Dest", "Rating", "Timestamp"]
amazon_network_data = amazon_network_data[["src", "Dest"]]
amazon_network_data1 = amazon_network_data.astype(str).groupby("src").agg(','.join).reset_index()
amazon_network_data1

                       src                              Dest
0       #oc-R103C0QSV1DF5E                        B006Q820X0
1       #oc-R109MU5OBBZ59U                        B008I1XPKA
2       #oc-R10LFEMQEW6QGZ                        B008I1XPKA
3       #oc-R10LT57ZGIB140                        B0026LJ3EA
4       #oc-R10UA029WVWIUI                        B006Q820X0
...                    ...                               ...
256053       AZZV9PDNMCOZW  B001E5E2QI,B000AXSG2Q,B003SNX4YA
256054       AZZVNIMTTMJH6                        B000FI4O90
256055       AZZY649VYAHQS                        B000N9VLJ2
256056       AZZYCJOJLUDYR                        B001SB22UG
256057       AZZZOVIBXHGDR                        B001EO5SB2

[256058 rows x 2 columns]

In [12]:
amazon_gt_data = pd.read_csv("amazon_gt.csv")
amazon_gt_data.columns = ["ID","Label"]
amazon_gt_data

                  ID  Label
0     A1J1QS7I60O018      1
1     A2V18JN5XI2GOB      1
2     A3RPL2RYFV2HVZ      1
3     A1HEI1CQHCNB0V      1
4      A7EJERNB7IK3Z      1
...              ...    ...
2593  A33WKYJSJOOZRN      1
2594   AFDNACPVKXXPZ      1
2595  A3N8KKKCPX8KZD      1
2596   AH5CQ8TKUURI7      1
2597  A1DB5QPH7WO488      1

[2598 rows x 2 columns]

In [ ]:
epinions_network_data = pd.read_csv("epinions_network.csv")
epinions_network_data.columns=["src", "Dest", "Rating", "Timestamp"]
epinions_network_data = epinions_network_data[["src", "Dest"]]
epinions_network_data1 = epinions_network_data.astype(str).groupby("Dest").agg(','.join).reset_index()
epinions_network_data1

In [14]:
epinions_gt_data = pd.read_csv("epinions_gt.csv")
epinions_gt_data.columns = ["ID","Label"]
epinions_gt_data

               ID  Label
0          219050     -1
1          431231     -1
2          305277     -1
3      3036450692     -1
4      5301702532     -1
...           ...    ...
10298      295491      1
10299      252420      1
10300      200118      1
10301      205639      1
10302      210284      1

[10303 rows x 2 columns]

In [25]:
otc_network_data = pd.read_csv("otc_network.csv")
otc_network_data.columns=["src", "Dest", "Rating", "Timestamp"]
otc_network_data = otc_network_data[["src", "Dest"]]
otc_network_data1 = otc_network_data.astype(str).groupby("Dest").agg(','.join).reset_index()
otc_network_data1

      Dest                                                src
0        1  21,10,5,13,32,34,31,35,17,8,47,54,56,71,74,78,...
1       10                                       13,21,1,41,6
2      100                       7,132,111,64,60,202,781,1810
3     1000                                                554
4     1001  1003,492,1002,273,928,1713,1764,3099,3597,1396...
...    ...                                                ...
5853   995                                   844,904,851,1153
5854   996                                                755
5855   997                                      838,1217,2877
5856   998                                                139
5857   999                                                632

[5858 rows x 2 columns]

In [16]:
otc_gt_data = pd.read_csv("otc_gt.csv")
otc_gt_data.columns = ["ID","Label"]
otc_gt_data

       ID  Label
0     132      1
1    2097      1
2    1268      1
3     135      1
4     134      1
..    ...    ...
310  4996     -1
311  5109     -1
312  3193     -1
313  4587     -1
314  4746     -1

[315 rows x 2 columns]